results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps1000-batch131072-acksall-prod12-compnone-trial1/producer-perf-3.log
producer_index=3
producer_count=12
producer_records=8334
producer_throughput=84
1 records sent, 0.1 records/sec (0.00 MB/sec), 15291.0 ms avg latency, 15291.0 ms max latency.
624 records sent, 119.7 records/sec (1.17 MB/sec), 5365.0 ms avg latency, 7028.0 ms max latency.
1532 records sent, 305.5 records/sec (2.98 MB/sec), 5344.1 ms avg latency, 8828.0 ms max latency.
420 records sent, 83.9 records/sec (0.82 MB/sec), 51.3 ms avg latency, 134.0 ms max latency.
423 records sent, 84.3 records/sec (0.82 MB/sec), 32.8 ms avg latency, 99.0 ms max latency.
423 records sent, 84.3 records/sec (0.82 MB/sec), 22.8 ms avg latency, 92.0 ms max latency.
422 records sent, 84.1 records/sec (0.82 MB/sec), 18.3 ms avg latency, 65.0 ms max latency.
421 records sent, 84.1 records/sec (0.82 MB/sec), 15.2 ms avg latency, 30.0 ms max latency.
422 records sent, 84.1 records/sec (0.82 MB/sec), 15.7 ms avg latency, 43.0 ms max latency.
421 records sent, 84.0 records/sec (0.82 MB/sec), 16.6 ms avg latency, 85.0 ms max latency.
421 records sent, 83.9 records/sec (0.82 MB/sec), 19.0 ms avg latency, 77.0 ms max latency.
421 records sent, 83.9 records/sec (0.82 MB/sec), 17.0 ms avg latency, 81.0 ms max latency.
421 records sent, 84.2 records/sec (0.82 MB/sec), 15.1 ms avg latency, 33.0 ms max latency.
422 records sent, 84.2 records/sec (0.82 MB/sec), 15.4 ms avg latency, 31.0 ms max latency.
420 records sent, 83.9 records/sec (0.82 MB/sec), 13.6 ms avg latency, 32.0 ms max latency.
422 records sent, 84.3 records/sec (0.82 MB/sec), 13.2 ms avg latency, 23.0 ms max latency.
421 records sent, 83.6 records/sec (0.82 MB/sec), 12.9 ms avg latency, 41.0 ms max latency.
8334 records sent, 83.727659 records/sec (0.82 MB/sec), 1400.54 ms avg latency, 15291.00 ms max latency, 19 ms 50th, 7279 ms 95th, 8521 ms 99th, 8827 ms 99.9th.